#+SETUPFILE: ../setup.org
#+TITLE: Correlation and Regression
#+AUTHOR: Dale Barr
#+PROPERTY: header-args:R :session *R* :exports both :results value

*** Transform back to raw units

The =exp()= function is the inverse of =log()=.

#+begin_src R :results output
  exp(newpeeps)
#+end_src

#+RESULTS:
:         height    weight
: [1,]  70.40108 196.94276
: [2,]  70.65632 133.64963
: [3,]  41.36254  42.93844
: [4,]  66.10779 117.24065
: [5,] 114.43045 485.50576
: [6,]  57.86453 122.30092


